[Killed] ConditionalExpression
lib/api/queries.ts:35:22
 // ============================================================================
 
 // Changed from '/api/v1' to '/api' to use Next.js proxy routes instead of MSW
-const API_BASE_URL = process.env.NEXT_PUBLIC_API_URL || '/api';
+const API_BASE_URL = false;
 
 // ============================================================================
killedBy: WorkflowList Rendering renders workflow cards after loading
statusReason: Unable to find role="article"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8"
    >

[Killed] ConditionalExpression
lib/api/queries.ts:35:22
 // ============================================================================
 
 // Changed from '/api/v1' to '/api' to use Next.js proxy routes instead of MSW
-const API_BASE_URL = process.env.NEXT_PUBLIC_API_URL || '/api';
+const API_BASE_URL = true;
 
 // ============================================================================
killedBy: WorkflowList Rendering renders workflow cards after loading
statusReason: Unable to find role="article"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8"
    >

[Killed] BlockStatement
lib/api/queries.ts:52:77
   }
 }
 
-async function fetchJson<T>(url: string, options?: RequestInit): Promise<T> {
-  const response = await fetch(url, {
-    ...options,
-    headers: {
-      'Content-Type': 'application/json',
-      ...options?.headers,
-    },
-  });
-
-  const data = await response.json();
-
-  if (!response.ok) {
-    throw new ApiError(
-      data.error || 'An error occurred',
-      response.status,
-      data.details
-    );
-  }
-
-  return data;
-}
+async function fetchJson<T>(url: string, options?: RequestInit): Promise<T> {}
 
 // ============================================================================
killedBy: TanStack Query Hooks API Error Handling creates ApiError with status and details
statusReason: expected 'Error' to be 'ApiError' // Object.is equality

[Survived] ObjectLiteral
lib/api/queries.ts:55:14
 async function fetchJson<T>(url: string, options?: RequestInit): Promise<T> {
   const response = await fetch(url, {
     ...options,
-    headers: {
-      'Content-Type': 'application/json',
-      ...options?.headers,
-    },
+    headers: {},
   });
 

[Killed] OptionalChaining
lib/api/queries.ts:57:10
     ...options,
     headers: {
       'Content-Type': 'application/json',
-      ...options?.headers,
+      ...options.headers,
     },
   });
killedBy: TanStack Query Hooks API Error Handling creates ApiError with status and details
statusReason: expected 'TypeError' to be 'ApiError' // Object.is equality

[Killed] ConditionalExpression
lib/api/queries.ts:63:7
 
   const data = await response.json();
 
-  if (!response.ok) {
+  if (true) {
     throw new ApiError(
       data.error || 'An error occurred',
killedBy: TanStack Query Hooks useWorkflows fetches workflow list successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
lib/api/queries.ts:63:7
 
   const data = await response.json();
 
-  if (!response.ok) {
+  if (false) {
     throw new ApiError(
       data.error || 'An error occurred',
killedBy: TanStack Query Hooks API Error Handling creates ApiError with status and details
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
lib/api/queries.ts:65:7
 
   if (!response.ok) {
     throw new ApiError(
-      data.error || 'An error occurred',
+      false,
       response.status,
       data.details
killedBy: TanStack Query Hooks API Error Handling uses fallback error message when data.error is missing
statusReason: expected 'false' to be 'An error occurred' // Object.is equality

[Killed] LogicalOperator
lib/api/queries.ts:65:7
 
   if (!response.ok) {
     throw new ApiError(
-      data.error || 'An error occurred',
+      data.error && 'An error occurred',
       response.status,
       data.details
killedBy: TanStack Query Hooks API Error Handling uses fallback error message when data.error is missing
statusReason: expected '' to be 'An error occurred' // Object.is equality

[Killed] ArrowFunction
lib/api/queries.ts:79:14
 // ============================================================================
 
 export const queryKeys = {
-  workflows: (filters?: { search?: string; namespace?: string; sort?: string }) =>
-    ['workflows', filters] as const,
+  workflows: () => undefined,
   workflowDetail: (name: string) => ['workflows', name] as const,
   workflowExecutions: (name: string, filters?: { status?: string; limit?: number; offset?: number }) =>
killedBy: TanStack Query Hooks useWorkflows uses different cache keys for different filters
statusReason: expected 5 to be less than 5

[Survived] ArrowFunction
lib/api/queries.ts:81:19
 export const queryKeys = {
   workflows: (filters?: { search?: string; namespace?: string; sort?: string }) =>
     ['workflows', filters] as const,
-  workflowDetail: (name: string) => ['workflows', name] as const,
+  workflowDetail: () => undefined,
   workflowExecutions: (name: string, filters?: { status?: string; limit?: number; offset?: number }) =>
     ['workflows', name, 'executions', filters] as const,

[Survived] ArrowFunction
lib/api/queries.ts:82:23
   workflows: (filters?: { search?: string; namespace?: string; sort?: string }) =>
     ['workflows', filters] as const,
   workflowDetail: (name: string) => ['workflows', name] as const,
-  workflowExecutions: (name: string, filters?: { status?: string; limit?: number; offset?: number }) =>
-    ['workflows', name, 'executions', filters] as const,
+  workflowExecutions: () => undefined,
   workflowDurationTrends: (name: string, daysBack: number) =>
     ['workflows', name, 'duration-trends', daysBack] as const,

[Survived] ArrowFunction
lib/api/queries.ts:84:27
   workflowDetail: (name: string) => ['workflows', name] as const,
   workflowExecutions: (name: string, filters?: { status?: string; limit?: number; offset?: number }) =>
     ['workflows', name, 'executions', filters] as const,
-  workflowDurationTrends: (name: string, daysBack: number) =>
-    ['workflows', name, 'duration-trends', daysBack] as const,
+  workflowDurationTrends: () => undefined,
   executionDetail: (id: string) => ['executions', id] as const,
   tasks: ['tasks'] as const,

[Survived] ArrowFunction
lib/api/queries.ts:86:20
     ['workflows', name, 'executions', filters] as const,
   workflowDurationTrends: (name: string, daysBack: number) =>
     ['workflows', name, 'duration-trends', daysBack] as const,
-  executionDetail: (id: string) => ['executions', id] as const,
+  executionDetail: () => undefined,
   tasks: ['tasks'] as const,
   taskDetail: (name: string) => ['tasks', name] as const,

[Survived] ArrowFunction
lib/api/queries.ts:88:15
     ['workflows', name, 'duration-trends', daysBack] as const,
   executionDetail: (id: string) => ['executions', id] as const,
   tasks: ['tasks'] as const,
-  taskDetail: (name: string) => ['tasks', name] as const,
+  taskDetail: () => undefined,
   taskUsage: (name: string, filters?: { skip?: number; take?: number }) =>
     ['tasks', name, 'usage', filters] as const,

[Survived] ArrowFunction
lib/api/queries.ts:89:14
   executionDetail: (id: string) => ['executions', id] as const,
   tasks: ['tasks'] as const,
   taskDetail: (name: string) => ['tasks', name] as const,
-  taskUsage: (name: string, filters?: { skip?: number; take?: number }) =>
-    ['tasks', name, 'usage', filters] as const,
+  taskUsage: () => undefined,
   taskExecutions: (name: string, filters?: { status?: string; skip?: number; take?: number }) =>
     ['tasks', name, 'executions', filters] as const,

[Survived] ArrowFunction
lib/api/queries.ts:91:19
   taskDetail: (name: string) => ['tasks', name] as const,
   taskUsage: (name: string, filters?: { skip?: number; take?: number }) =>
     ['tasks', name, 'usage', filters] as const,
-  taskExecutions: (name: string, filters?: { status?: string; skip?: number; take?: number }) =>
-    ['tasks', name, 'executions', filters] as const,
+  taskExecutions: () => undefined,
   taskDurationTrends: (name: string, daysBack: number) =>
     ['tasks', name, 'duration-trends', daysBack] as const,

[Survived] ArrowFunction
lib/api/queries.ts:93:23
     ['tasks', name, 'usage', filters] as const,
   taskExecutions: (name: string, filters?: { status?: string; skip?: number; take?: number }) =>
     ['tasks', name, 'executions', filters] as const,
-  taskDurationTrends: (name: string, daysBack: number) =>
-    ['tasks', name, 'duration-trends', daysBack] as const,
+  taskDurationTrends: () => undefined,
 };
 

[Killed] BlockStatement
lib/api/queries.ts:108:4
   search?: string;
   namespace?: string;
   sort?: string;
-}) {
-  return useQuery({
-    queryKey: queryKeys.workflows(filters),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      if (filters?.search) params.append('search', filters.search);
-      if (filters?.namespace) params.append('namespace', filters.namespace);
-      if (filters?.sort) params.append('sort', filters.sort);
-
-      const url = params.toString()
-        ? `${API_BASE_URL}/workflows?${params}`
-        : `${API_BASE_URL}/workflows`;
-
-      const data = await fetchJson<{ workflows: WorkflowListItem[]; total: number }>(url);
-      return data;
-    },
-    staleTime: 30000, // Consider data fresh for 30 seconds
-    gcTime: 300000, // Keep in cache for 5 minutes
-  });
-}
+}) {}
 
 /**
killedBy: TanStack Query Hooks useWorkflows fetches workflow list successfully
statusReason: Cannot read properties of undefined (reading 'isLoading')

[Killed] BlockStatement
lib/api/queries.ts:111:26
 }) {
   return useQuery({
     queryKey: queryKeys.workflows(filters),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      if (filters?.search) params.append('search', filters.search);
-      if (filters?.namespace) params.append('namespace', filters.namespace);
-      if (filters?.sort) params.append('sort', filters.sort);
-
-      const url = params.toString()
-        ? `${API_BASE_URL}/workflows?${params}`
-        : `${API_BASE_URL}/workflows`;
-
-      const data = await fetchJson<{ workflows: WorkflowListItem[]; total: number }>(url);
-      return data;
-    },
+    queryFn: async () => {},
     staleTime: 30000, // Consider data fresh for 30 seconds
     gcTime: 300000, // Keep in cache for 5 minutes
killedBy: TanStack Query Hooks useWorkflows fetches workflow list successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] OptionalChaining
lib/api/queries.ts:113:11
     queryKey: queryKeys.workflows(filters),
     queryFn: async () => {
       const params = new URLSearchParams();
-      if (filters?.search) params.append('search', filters.search);
+      if (filters.search) params.append('search', filters.search);
       if (filters?.namespace) params.append('namespace', filters.namespace);
       if (filters?.sort) params.append('sort', filters.sort);
killedBy: TanStack Query Hooks useWorkflows fetches workflow list successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
lib/api/queries.ts:113:11
     queryKey: queryKeys.workflows(filters),
     queryFn: async () => {
       const params = new URLSearchParams();
-      if (filters?.search) params.append('search', filters.search);
+      if (true) params.append('search', filters.search);
       if (filters?.namespace) params.append('namespace', filters.namespace);
       if (filters?.sort) params.append('sort', filters.sort);
killedBy: TanStack Query Hooks useWorkflows fetches workflow list successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] OptionalChaining
lib/api/queries.ts:114:11
     queryFn: async () => {
       const params = new URLSearchParams();
       if (filters?.search) params.append('search', filters.search);
-      if (filters?.namespace) params.append('namespace', filters.namespace);
+      if (filters.namespace) params.append('namespace', filters.namespace);
       if (filters?.sort) params.append('sort', filters.sort);
 
killedBy: TanStack Query Hooks useWorkflows fetches workflow list successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
lib/api/queries.ts:114:11
     queryFn: async () => {
       const params = new URLSearchParams();
       if (filters?.search) params.append('search', filters.search);
-      if (filters?.namespace) params.append('namespace', filters.namespace);
+      if (false) params.append('namespace', filters.namespace);
       if (filters?.sort) params.append('sort', filters.sort);
 
killedBy: TanStack Query Hooks useWorkflows filters workflows by namespace
statusReason: expected 'analytics' to be 'production' // Object.is equality

[Killed] ConditionalExpression
lib/api/queries.ts:115:11
       const params = new URLSearchParams();
       if (filters?.search) params.append('search', filters.search);
       if (filters?.namespace) params.append('namespace', filters.namespace);
-      if (filters?.sort) params.append('sort', filters.sort);
+      if (false) params.append('sort', filters.sort);
 
       const url = params.toString()
killedBy: WorkflowList Sorting sorts workflows by success rate when selected
statusReason: expected 89.7 to be greater than or equal to 94.2

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] OptionalChaining
lib/api/queries.ts:115:11
       const params = new URLSearchParams();
       if (filters?.search) params.append('search', filters.search);
       if (filters?.namespace) params.append('namespace', filters.namespace);
-      if (filters?.sort) params.append('sort', filters.sort);
+      if (filters.sort) params.append('sort', filters.sort);
 
       const url = params.toString()
killedBy: TanStack Query Hooks useWorkflows fetches workflow list successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:132:82
 /**
  * Fetch workflow details by name
  */
-export function useWorkflowDetail(name: string, options?: { enabled?: boolean }) {
-  return useQuery({
-    queryKey: queryKeys.workflowDetail(name),
-    queryFn: async () => {
-      const data = await fetchJson<WorkflowDetail>(
-        `${API_BASE_URL}/workflows/${name}`
-      );
-      return data;
-    },
-    staleTime: 60000, // 1 minute
-    gcTime: 300000, // 5 minutes
-    enabled: options?.enabled ?? true,
-  });
-}
+export function useWorkflowDetail(name: string, options?: { enabled?: boolean }) {}
 
 /**
killedBy: TanStack Query Hooks API Error Handling creates ApiError with status and details
statusReason: Cannot read properties of undefined (reading 'isError')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:135:26
 export function useWorkflowDetail(name: string, options?: { enabled?: boolean }) {
   return useQuery({
     queryKey: queryKeys.workflowDetail(name),
-    queryFn: async () => {
-      const data = await fetchJson<WorkflowDetail>(
-        `${API_BASE_URL}/workflows/${name}`
-      );
-      return data;
-    },
+    queryFn: async () => {},
     staleTime: 60000, // 1 minute
     gcTime: 300000, // 5 minutes
killedBy: TanStack Query Hooks API Error Handling creates ApiError with status and details
statusReason: expected 'Error' to be 'ApiError' // Object.is equality

[Killed] BooleanLiteral
lib/api/queries.ts:143:34
     },
     staleTime: 60000, // 1 minute
     gcTime: 300000, // 5 minutes
-    enabled: options?.enabled ?? true,
+    enabled: options?.enabled ?? false,
   });
 }
killedBy: TanStack Query Hooks API Error Handling creates ApiError with status and details
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] OptionalChaining
lib/api/queries.ts:143:14
     },
     staleTime: 60000, // 1 minute
     gcTime: 300000, // 5 minutes
-    enabled: options?.enabled ?? true,
+    enabled: options.enabled ?? true,
   });
 }
killedBy: TanStack Query Hooks API Error Handling creates ApiError with status and details
statusReason: Cannot read properties of undefined (reading 'enabled')

[Killed] BlockStatement
lib/api/queries.ts:157:3
     limit?: number;
     offset?: number;
   }
-) {
-  const { status, limit = 10, offset = 0 } = filters || {};
-
-  return useQuery({
-    queryKey: queryKeys.workflowExecutions(name, { status, limit, offset }),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      if (status) params.append('status', status);
-      params.append('limit', String(limit));
-      params.append('offset', String(offset));
-
-      const data = await fetchJson<{
-        executions: ExecutionHistoryItem[];
-        total: number;
-        limit: number;
-        offset: number;
-      }>(`${API_BASE_URL}/workflows/${name}/executions?${params}`);
-      return data;
-    },
-    staleTime: 10000, // 10 seconds (execution history updates frequently)
-    gcTime: 60000, // 1 minute
-  });
-}
+) {}
 
 /**
killedBy: TanStack Query Hooks useWorkflowExecutions fetches execution history successfully
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
lib/api/queries.ts:158:46
     offset?: number;
   }
 ) {
-  const { status, limit = 10, offset = 0 } = filters || {};
+  const { status, limit = 10, offset = 0 } = true;
 
   return useQuery({
killedBy: TanStack Query Hooks useWorkflowExecutions supports pagination filters
statusReason: expected 10 to be 2 // Object.is equality

[Killed] LogicalOperator
lib/api/queries.ts:158:46
     offset?: number;
   }
 ) {
-  const { status, limit = 10, offset = 0 } = filters || {};
+  const { status, limit = 10, offset = 0 } = filters && {};
 
   return useQuery({
killedBy: TanStack Query Hooks useWorkflowExecutions fetches execution history successfully
statusReason: Cannot destructure property 'status' of '(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)' as it is undefined.

[Killed] BlockStatement
lib/api/queries.ts:162:26
 
   return useQuery({
     queryKey: queryKeys.workflowExecutions(name, { status, limit, offset }),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      if (status) params.append('status', status);
-      params.append('limit', String(limit));
-      params.append('offset', String(offset));
-
-      const data = await fetchJson<{
-        executions: ExecutionHistoryItem[];
-        total: number;
-        limit: number;
-        offset: number;
-      }>(`${API_BASE_URL}/workflows/${name}/executions?${params}`);
-      return data;
-    },
+    queryFn: async () => {},
     staleTime: 10000, // 10 seconds (execution history updates frequently)
     gcTime: 60000, // 1 minute
killedBy: TanStack Query Hooks useWorkflowExecutions fetches execution history successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
lib/api/queries.ts:164:11
     queryKey: queryKeys.workflowExecutions(name, { status, limit, offset }),
     queryFn: async () => {
       const params = new URLSearchParams();
-      if (status) params.append('status', status);
+      if (false) params.append('status', status);
       params.append('limit', String(limit));
       params.append('offset', String(offset));
killedBy: TanStack Query Hooks useWorkflowExecutions supports status filtering
statusReason: expected 'success' to be 'succeeded' // Object.is equality

[Survived] ConditionalExpression
lib/api/queries.ts:164:11
     queryKey: queryKeys.workflowExecutions(name, { status, limit, offset }),
     queryFn: async () => {
       const params = new URLSearchParams();
-      if (status) params.append('status', status);
+      if (true) params.append('status', status);
       params.append('limit', String(limit));
       params.append('offset', String(offset));

[Killed] StringLiteral
lib/api/queries.ts:165:21
     queryFn: async () => {
       const params = new URLSearchParams();
       if (status) params.append('status', status);
-      params.append('limit', String(limit));
+      params.append("", String(limit));
       params.append('offset', String(offset));
 
killedBy: TanStack Query Hooks useWorkflowExecutions supports pagination filters
statusReason: expected 10 to be 2 // Object.is equality

[Survived] StringLiteral
lib/api/queries.ts:166:21
       const params = new URLSearchParams();
       if (status) params.append('status', status);
       params.append('limit', String(limit));
-      params.append('offset', String(offset));
+      params.append("", String(offset));
 
       const data = await fetchJson<{

[Killed] BlockStatement
lib/api/queries.ts:184:81
 /**
  * Fetch execution details by ID
  */
-export function useExecutionDetail(id: string, options?: { enabled?: boolean }) {
-  return useQuery({
-    queryKey: queryKeys.executionDetail(id),
-    queryFn: async () => {
-      const data = await fetchJson<WorkflowExecutionResponse>(
-        `${API_BASE_URL}/executions/${id}`
-      );
-      return data;
-    },
-    staleTime: 60000, // 1 minute
-    gcTime: 300000, // 5 minutes
-    enabled: options?.enabled ?? true,
-  });
-}
+export function useExecutionDetail(id: string, options?: { enabled?: boolean }) {}
 
 /**
killedBy: TanStack Query Hooks useExecutionDetail fetches execution details successfully
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:187:26
 export function useExecutionDetail(id: string, options?: { enabled?: boolean }) {
   return useQuery({
     queryKey: queryKeys.executionDetail(id),
-    queryFn: async () => {
-      const data = await fetchJson<WorkflowExecutionResponse>(
-        `${API_BASE_URL}/executions/${id}`
-      );
-      return data;
-    },
+    queryFn: async () => {},
     staleTime: 60000, // 1 minute
     gcTime: 300000, // 5 minutes
killedBy: TanStack Query Hooks useExecutionDetail fetches execution details successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:206:3
   name: string,
   daysBack: number = 30,
   options?: { enabled?: boolean }
-) {
-  return useQuery({
-    queryKey: queryKeys.workflowDurationTrends(name, daysBack),
-    queryFn: async () => {
-      const data = await fetchJson<DurationTrendsResponse>(
-        `${API_BASE_URL}/workflows/${name}/duration-trends?daysBack=${daysBack}`
-      );
-
-      // Parse date strings to Date objects
-      return {
-        ...data,
-        dataPoints: data.dataPoints.map(point => ({
-          ...point,
-          date: new Date(point.date),
-        })),
-      };
-    },
-    staleTime: 300000, // 5 minutes (trends change slowly)
-    gcTime: 900000, // 15 minutes
-    enabled: options?.enabled ?? !!name,
-  });
-}
+) {}
 
 // ============================================================================
killedBy: TanStack Query Hooks useWorkflowDurationTrends fetches duration trends successfully
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:209:26
 ) {
   return useQuery({
     queryKey: queryKeys.workflowDurationTrends(name, daysBack),
-    queryFn: async () => {
-      const data = await fetchJson<DurationTrendsResponse>(
-        `${API_BASE_URL}/workflows/${name}/duration-trends?daysBack=${daysBack}`
-      );
-
-      // Parse date strings to Date objects
-      return {
-        ...data,
-        dataPoints: data.dataPoints.map(point => ({
-          ...point,
-          date: new Date(point.date),
-        })),
-      };
-    },
+    queryFn: async () => {},
     staleTime: 300000, // 5 minutes (trends change slowly)
     gcTime: 900000, // 15 minutes
killedBy: TanStack Query Hooks useWorkflowDurationTrends fetches duration trends successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
lib/api/queries.ts:217:41
       // Parse date strings to Date objects
       return {
         ...data,
-        dataPoints: data.dataPoints.map(point => ({
-          ...point,
-          date: new Date(point.date),
-        })),
+        dataPoints: data.dataPoints.map(() => undefined),
       };
     },
killedBy: TanStack Query Hooks useWorkflowDurationTrends parses date strings to Date objects
statusReason: Cannot read properties of undefined (reading 'date')

[Killed] BooleanLiteral
lib/api/queries.ts:225:35
     },
     staleTime: 300000, // 5 minutes (trends change slowly)
     gcTime: 900000, // 15 minutes
-    enabled: options?.enabled ?? !!name,
+    enabled: options?.enabled ?? !name,
   });
 }
killedBy: TanStack Query Hooks useWorkflowDurationTrends fetches duration trends successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
lib/api/queries.ts:225:14
     },
     staleTime: 300000, // 5 minutes (trends change slowly)
     gcTime: 900000, // 15 minutes
-    enabled: options?.enabled ?? !!name,
+    enabled: options?.enabled && !!name,
   });
 }
killedBy: TanStack Query Hooks useWorkflowDurationTrends is disabled when name is empty
statusReason: expected 'fetching' to be 'idle' // Object.is equality

[Killed] BlockStatement
lib/api/queries.ts:240:59
   const queryClient = useQueryClient();
 
   return useMutation({
-    mutationFn: async (input: Record<string, unknown>) => {
-      const data = await fetchJson<WorkflowExecutionResponse>(
-        `${API_BASE_URL}/workflows/${name}/execute`,
-        {
-          method: 'POST',
-          body: JSON.stringify(input),
-        }
-      );
-      return data;
-    },
+    mutationFn: async (input: Record<string, unknown>) => {},
     onSuccess: () => {
       // Invalidate execution history to show new execution
killedBy: TanStack Query Hooks useExecuteWorkflow executes workflow successfully
statusReason: expected undefined to be defined

[Killed] StringLiteral
lib/api/queries.ts:242:9
   return useMutation({
     mutationFn: async (input: Record<string, unknown>) => {
       const data = await fetchJson<WorkflowExecutionResponse>(
-        `${API_BASE_URL}/workflows/${name}/execute`,
+        ``,
         {
           method: 'POST',
killedBy: TanStack Query Hooks useExecuteWorkflow executes workflow successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] BlockStatement
lib/api/queries.ts:250:22
       );
       return data;
     },
-    onSuccess: () => {
-      // Invalidate execution history to show new execution
-      queryClient.invalidateQueries({
-        queryKey: queryKeys.workflowExecutions(name),
-      });
-      // Invalidate workflow list to update stats (all filters)
-      queryClient.invalidateQueries({
-        queryKey: ['workflows'],
-      });
-    },
+    onSuccess: () => {},
   });
 }

[Survived] ObjectLiteral
lib/api/queries.ts:252:37
     },
     onSuccess: () => {
       // Invalidate execution history to show new execution
-      queryClient.invalidateQueries({
-        queryKey: queryKeys.workflowExecutions(name),
-      });
+      queryClient.invalidateQueries({});
       // Invalidate workflow list to update stats (all filters)
       queryClient.invalidateQueries({

[Survived] ObjectLiteral
lib/api/queries.ts:256:37
         queryKey: queryKeys.workflowExecutions(name),
       });
       // Invalidate workflow list to update stats (all filters)
-      queryClient.invalidateQueries({
-        queryKey: ['workflows'],
-      });
+      queryClient.invalidateQueries({});
     },
   });
