[Killed] BlockStatement
lib/api/queries.ts:266:41
 /**
  * Dry-run a workflow (validation + execution plan)
  */
-export function useDryRun(name: string) {
-  return useMutation({
-    mutationFn: async (input: Record<string, unknown>) => {
-      const data = await fetchJson<DryRunResponse>(
-        `${API_BASE_URL}/workflows/${name}/test`,
-        {
-          method: 'POST',
-          body: JSON.stringify(input),
-        }
-      );
-      return data;
-    },
-  });
-}
+export function useDryRun(name: string) {}
 
 // ============================================================================
killedBy: TanStack Query Hooks useDryRun performs dry-run successfully
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] BlockStatement
lib/api/queries.ts:268:59
  */
 export function useDryRun(name: string) {
   return useMutation({
-    mutationFn: async (input: Record<string, unknown>) => {
-      const data = await fetchJson<DryRunResponse>(
-        `${API_BASE_URL}/workflows/${name}/test`,
-        {
-          method: 'POST',
-          body: JSON.stringify(input),
-        }
-      );
-      return data;
-    },
+    mutationFn: async (input: Record<string, unknown>) => {},
   });
 }
killedBy: TanStack Query Hooks useDryRun performs dry-run successfully
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
lib/api/queries.ts:271:9
     mutationFn: async (input: Record<string, unknown>) => {
       const data = await fetchJson<DryRunResponse>(
         `${API_BASE_URL}/workflows/${name}/test`,
-        {
-          method: 'POST',
-          body: JSON.stringify(input),
-        }
+        {}
       );
       return data;
killedBy: TanStack Query Hooks useDryRun performs dry-run successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:288:28
 /**
  * Fetch all available tasks
  */
-export function useTasks() {
-  return useQuery({
-    queryKey: queryKeys.tasks,
-    queryFn: async () => {
-      const data = await fetchJson<{
-        tasks: Array<{
-          name: string;
-          description: string;
-          inputSchema: unknown;
-          outputSchema: unknown;
-        }>;
-      }>(`${API_BASE_URL}/tasks`);
-      return data;
-    },
-    staleTime: 300000, // 5 minutes (tasks don't change often)
-    gcTime: 600000, // 10 minutes
-  });
-}
+export function useTasks() {}
 
 // ============================================================================
killedBy: TanStack Query Hooks useTasks fetches available tasks successfully
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:291:26
 export function useTasks() {
   return useQuery({
     queryKey: queryKeys.tasks,
-    queryFn: async () => {
-      const data = await fetchJson<{
-        tasks: Array<{
-          name: string;
-          description: string;
-          inputSchema: unknown;
-          outputSchema: unknown;
-        }>;
-      }>(`${API_BASE_URL}/tasks`);
-      return data;
-    },
+    queryFn: async () => {},
     staleTime: 300000, // 5 minutes (tasks don't change often)
     gcTime: 600000, // 10 minutes
killedBy: TanStack Query Hooks useTasks fetches available tasks successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
lib/api/queries.ts:299:10
           inputSchema: unknown;
           outputSchema: unknown;
         }>;
-      }>(`${API_BASE_URL}/tasks`);
+      }>(``);
       return data;
     },
killedBy: TanStack Query Hooks useTasks fetches available tasks successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:314:45
 /**
  * Prefetch workflow detail (useful for optimistic UI)
  */
-export function usePrefetchWorkflowDetail() {
-  const queryClient = useQueryClient();
-
-  return (name: string) => {
-    queryClient.prefetchQuery({
-      queryKey: queryKeys.workflowDetail(name),
-      queryFn: async () => {
-        const data = await fetchJson<WorkflowDetail>(
-          `${API_BASE_URL}/workflows/${name}`
-        );
-        return data;
-      },
-    });
-  };
-}
+export function usePrefetchWorkflowDetail() {}
 
 /**
killedBy: TanStack Query Hooks Utility hooks usePrefetchWorkflowDetail prefetches workflow data
statusReason: prefetchResult.current is not a function

[Survived] BlockStatement
lib/api/queries.ts:317:28
 export function usePrefetchWorkflowDetail() {
   const queryClient = useQueryClient();
 
-  return (name: string) => {
-    queryClient.prefetchQuery({
-      queryKey: queryKeys.workflowDetail(name),
-      queryFn: async () => {
-        const data = await fetchJson<WorkflowDetail>(
-          `${API_BASE_URL}/workflows/${name}`
-        );
-        return data;
-      },
-    });
-  };
+  return (name: string) => {};
 }
 

[Killed] BlockStatement
lib/api/queries.ts:333:42
 /**
  * Invalidate all workflow-related queries (useful after workflow updates)
  */
-export function useInvalidateWorkflows() {
-  const queryClient = useQueryClient();
-
-  return () => {
-    queryClient.invalidateQueries({ queryKey: ['workflows'] });
-  };
-}
+export function useInvalidateWorkflows() {}
 
 // ============================================================================
killedBy: TanStack Query Hooks Utility hooks useInvalidateWorkflows calls invalidateQueries
statusReason: expected undefined to be an instance of Function

[Survived] BlockStatement
lib/api/queries.ts:336:16
 export function useInvalidateWorkflows() {
   const queryClient = useQueryClient();
 
-  return () => {
-    queryClient.invalidateQueries({ queryKey: ['workflows'] });
-  };
+  return () => {};
 }
 

[Survived] StringLiteral
lib/api/queries.ts:337:48
   const queryClient = useQueryClient();
 
   return () => {
-    queryClient.invalidateQueries({ queryKey: ['workflows'] });
+    queryClient.invalidateQueries({ queryKey: [""] });
   };
 }

[Survived] ObjectLiteral
lib/api/queries.ts:337:35
   const queryClient = useQueryClient();
 
   return () => {
-    queryClient.invalidateQueries({ queryKey: ['workflows'] });
+    queryClient.invalidateQueries({});
   };
 }

[Killed] BlockStatement
lib/api/queries.ts:348:78
 /**
  * Fetch detailed task information by name
  */
-export function useTaskDetail(name: string, options?: { enabled?: boolean }) {
-  return useQuery({
-    queryKey: queryKeys.taskDetail(name),
-    queryFn: async () => {
-      const data = await fetchJson<TaskDetail>(
-        `${API_BASE_URL}/tasks/${name}`
-      );
-      return data;
-    },
-    staleTime: 60000, // 1 minute
-    gcTime: 300000, // 5 minutes
-    enabled: options?.enabled ?? true,
-  });
-}
+export function useTaskDetail(name: string, options?: { enabled?: boolean }) {}
 
 /**
killedBy: TanStack Query Hooks useTaskDetail fetches task details successfully
statusReason: Cannot read properties of undefined (reading 'isLoading')

[Killed] BlockStatement
lib/api/queries.ts:351:26
 export function useTaskDetail(name: string, options?: { enabled?: boolean }) {
   return useQuery({
     queryKey: queryKeys.taskDetail(name),
-    queryFn: async () => {
-      const data = await fetchJson<TaskDetail>(
-        `${API_BASE_URL}/tasks/${name}`
-      );
-      return data;
-    },
+    queryFn: async () => {},
     staleTime: 60000, // 1 minute
     gcTime: 300000, // 5 minutes
killedBy: TanStack Query Hooks useTaskDetail fetches task details successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
lib/api/queries.ts:353:9
     queryKey: queryKeys.taskDetail(name),
     queryFn: async () => {
       const data = await fetchJson<TaskDetail>(
-        `${API_BASE_URL}/tasks/${name}`
+        ``
       );
       return data;
killedBy: TanStack Query Hooks useTaskDetail fetches task details successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:366:41
 /**
  * Prefetch task detail (useful for optimistic UI)
  */
-export function usePrefetchTaskDetail() {
-  const queryClient = useQueryClient();
-
-  return (name: string) => {
-    queryClient.prefetchQuery({
-      queryKey: queryKeys.taskDetail(name),
-      queryFn: async () => {
-        const data = await fetchJson<TaskDetail>(
-          `${API_BASE_URL}/tasks/${name}`
-        );
-        return data;
-      },
-    });
-  };
-}
+export function usePrefetchTaskDetail() {}
 
 /**
killedBy: TanStack Query Hooks usePrefetchTaskDetail prefetches task data
statusReason: prefetchResult.current is not a function

[Survived] BlockStatement
lib/api/queries.ts:369:28
 export function usePrefetchTaskDetail() {
   const queryClient = useQueryClient();
 
-  return (name: string) => {
-    queryClient.prefetchQuery({
-      queryKey: queryKeys.taskDetail(name),
-      queryFn: async () => {
-        const data = await fetchJson<TaskDetail>(
-          `${API_BASE_URL}/tasks/${name}`
-        );
-        return data;
-      },
-    });
-  };
+  return (name: string) => {};
 }
 

[Killed] BlockStatement
lib/api/queries.ts:391:3
     skip?: number;
     take?: number;
   }
-) {
-  const { skip = 0, take = 20 } = filters || {};
-
-  return useQuery({
-    queryKey: queryKeys.taskUsage(name, { skip, take }),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      params.append('skip', String(skip));
-      params.append('take', String(take));
-
-      const data = await fetchJson<{
-        taskName: string;
-        workflows: TaskUsageItem[];
-        totalCount: number;
-        skip: number;
-        take: number;
-      }>(`${API_BASE_URL}/tasks/${name}/usage?${params}`);
-      return data;
-    },
-    staleTime: 30000, // 30 seconds
-    gcTime: 300000, // 5 minutes
-  });
-}
+) {}
 
 /**
killedBy: TanStack Query Hooks useTaskUsage fetches workflows using a task
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
lib/api/queries.ts:392:35
     take?: number;
   }
 ) {
-  const { skip = 0, take = 20 } = filters || {};
+  const { skip = 0, take = 20 } = false;
 
   return useQuery({
killedBy: TanStack Query Hooks useTaskUsage supports pagination
statusReason: expected 20 to be 5 // Object.is equality

[Killed] ConditionalExpression
lib/api/queries.ts:392:35
     take?: number;
   }
 ) {
-  const { skip = 0, take = 20 } = filters || {};
+  const { skip = 0, take = 20 } = true;
 
   return useQuery({
killedBy: TanStack Query Hooks useTaskUsage supports pagination
statusReason: expected 20 to be 5 // Object.is equality

[Killed] ObjectLiteral
lib/api/queries.ts:394:19
 ) {
   const { skip = 0, take = 20 } = filters || {};
 
-  return useQuery({
-    queryKey: queryKeys.taskUsage(name, { skip, take }),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      params.append('skip', String(skip));
-      params.append('take', String(take));
-
-      const data = await fetchJson<{
-        taskName: string;
-        workflows: TaskUsageItem[];
-        totalCount: number;
-        skip: number;
-        take: number;
-      }>(`${API_BASE_URL}/tasks/${name}/usage?${params}`);
-      return data;
-    },
-    staleTime: 30000, // 30 seconds
-    gcTime: 300000, // 5 minutes
-  });
+  return useQuery({});
 }
 
killedBy: TanStack Query Hooks useTaskUsage fetches workflows using a task
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:396:26
 
   return useQuery({
     queryKey: queryKeys.taskUsage(name, { skip, take }),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      params.append('skip', String(skip));
-      params.append('take', String(take));
-
-      const data = await fetchJson<{
-        taskName: string;
-        workflows: TaskUsageItem[];
-        totalCount: number;
-        skip: number;
-        take: number;
-      }>(`${API_BASE_URL}/tasks/${name}/usage?${params}`);
-      return data;
-    },
+    queryFn: async () => {},
     staleTime: 30000, // 30 seconds
     gcTime: 300000, // 5 minutes
killedBy: TanStack Query Hooks useTaskUsage fetches workflows using a task
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] StringLiteral
lib/api/queries.ts:398:21
     queryKey: queryKeys.taskUsage(name, { skip, take }),
     queryFn: async () => {
       const params = new URLSearchParams();
-      params.append('skip', String(skip));
+      params.append("", String(skip));
       params.append('take', String(take));
 

[Killed] StringLiteral
lib/api/queries.ts:399:21
     queryFn: async () => {
       const params = new URLSearchParams();
       params.append('skip', String(skip));
-      params.append('take', String(take));
+      params.append("", String(take));
 
       const data = await fetchJson<{
killedBy: TanStack Query Hooks useTaskUsage supports pagination
statusReason: expected 20 to be 5 // Object.is equality

[Killed] BlockStatement
lib/api/queries.ts:425:3
     skip?: number;
     take?: number;
   }
-) {
-  const { status, skip = 0, take = 20 } = filters || {};
-
-  return useQuery({
-    queryKey: queryKeys.taskExecutions(name, { status, skip, take }),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      if (status) params.append('status', status);
-      params.append('skip', String(skip));
-      params.append('take', String(take));
-
-      const data = await fetchJson<{
-        taskName: string;
-        executions: TaskExecutionItem[];
-        averageDurationMs: number;
-        totalCount: number;
-        skip: number;
-        take: number;
-      }>(`${API_BASE_URL}/tasks/${name}/executions?${params}`);
-      return data;
-    },
-    staleTime: 10000, // 10 seconds (execution history updates frequently)
-    gcTime: 60000, // 1 minute
-  });
-}
+) {}
 
 /**
killedBy: TanStack Query Hooks useTaskExecutions fetches task execution history
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
lib/api/queries.ts:426:43
     take?: number;
   }
 ) {
-  const { status, skip = 0, take = 20 } = filters || {};
+  const { status, skip = 0, take = 20 } = true;
 
   return useQuery({
killedBy: TanStack Query Hooks useTaskExecutions supports pagination
statusReason: expected 20 to be 10 // Object.is equality

[Killed] LogicalOperator
lib/api/queries.ts:426:43
     take?: number;
   }
 ) {
-  const { status, skip = 0, take = 20 } = filters || {};
+  const { status, skip = 0, take = 20 } = filters && {};
 
   return useQuery({
killedBy: TanStack Query Hooks useTaskExecutions fetches task execution history
statusReason: Cannot destructure property 'status' of '(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)' as it is undefined.

[Killed] ObjectLiteral
lib/api/queries.ts:428:19
 ) {
   const { status, skip = 0, take = 20 } = filters || {};
 
-  return useQuery({
-    queryKey: queryKeys.taskExecutions(name, { status, skip, take }),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      if (status) params.append('status', status);
-      params.append('skip', String(skip));
-      params.append('take', String(take));
-
-      const data = await fetchJson<{
-        taskName: string;
-        executions: TaskExecutionItem[];
-        averageDurationMs: number;
-        totalCount: number;
-        skip: number;
-        take: number;
-      }>(`${API_BASE_URL}/tasks/${name}/executions?${params}`);
-      return data;
-    },
-    staleTime: 10000, // 10 seconds (execution history updates frequently)
-    gcTime: 60000, // 1 minute
-  });
+  return useQuery({});
 }
 
killedBy: TanStack Query Hooks useTaskExecutions fetches task execution history
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:430:26
 
   return useQuery({
     queryKey: queryKeys.taskExecutions(name, { status, skip, take }),
-    queryFn: async () => {
-      const params = new URLSearchParams();
-      if (status) params.append('status', status);
-      params.append('skip', String(skip));
-      params.append('take', String(take));
-
-      const data = await fetchJson<{
-        taskName: string;
-        executions: TaskExecutionItem[];
-        averageDurationMs: number;
-        totalCount: number;
-        skip: number;
-        take: number;
-      }>(`${API_BASE_URL}/tasks/${name}/executions?${params}`);
-      return data;
-    },
+    queryFn: async () => {},
     staleTime: 10000, // 10 seconds (execution history updates frequently)
     gcTime: 60000, // 1 minute
killedBy: TanStack Query Hooks useTaskExecutions fetches task execution history
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] StringLiteral
lib/api/queries.ts:433:21
     queryFn: async () => {
       const params = new URLSearchParams();
       if (status) params.append('status', status);
-      params.append('skip', String(skip));
+      params.append("", String(skip));
       params.append('take', String(take));
 

[Killed] BlockStatement
lib/api/queries.ts:458:3
   name: string,
   daysBack: number = 30,
   options?: { enabled?: boolean }
-) {
-  return useQuery({
-    queryKey: queryKeys.taskDurationTrends(name, daysBack),
-    queryFn: async () => {
-      const data = await fetchJson<DurationTrendsResponse>(
-        `${API_BASE_URL}/tasks/${name}/duration-trends?daysBack=${daysBack}`
-      );
-
-      // Parse date strings to Date objects
-      return {
-        ...data,
-        dataPoints: data.dataPoints.map(point => ({
-          ...point,
-          date: new Date(point.date),
-        })),
-      };
-    },
-    staleTime: 300000, // 5 minutes (trends change slowly)
-    gcTime: 900000, // 15 minutes
-    enabled: options?.enabled ?? !!name,
-  });
-}
+) {}
 
 // ============================================================================
killedBy: TanStack Query Hooks useTaskDurationTrends fetches task duration trends successfully
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
lib/api/queries.ts:461:26
 ) {
   return useQuery({
     queryKey: queryKeys.taskDurationTrends(name, daysBack),
-    queryFn: async () => {
-      const data = await fetchJson<DurationTrendsResponse>(
-        `${API_BASE_URL}/tasks/${name}/duration-trends?daysBack=${daysBack}`
-      );
-
-      // Parse date strings to Date objects
-      return {
-        ...data,
-        dataPoints: data.dataPoints.map(point => ({
-          ...point,
-          date: new Date(point.date),
-        })),
-      };
-    },
+    queryFn: async () => {},
     staleTime: 300000, // 5 minutes (trends change slowly)
     gcTime: 900000, // 15 minutes
killedBy: TanStack Query Hooks useTaskDurationTrends fetches task duration trends successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
lib/api/queries.ts:467:14
       );
 
       // Parse date strings to Date objects
-      return {
-        ...data,
-        dataPoints: data.dataPoints.map(point => ({
-          ...point,
-          date: new Date(point.date),
-        })),
-      };
+      return {};
     },
     staleTime: 300000, // 5 minutes (trends change slowly)
killedBy: TanStack Query Hooks useTaskDurationTrends fetches task duration trends successfully
statusReason: expected undefined to be defined

[Killed] OptionalChaining
lib/api/queries.ts:477:14
     },
     staleTime: 300000, // 5 minutes (trends change slowly)
     gcTime: 900000, // 15 minutes
-    enabled: options?.enabled ?? !!name,
+    enabled: options.enabled ?? !!name,
   });
 }
killedBy: TanStack Query Hooks useTaskDurationTrends fetches task duration trends successfully
statusReason: Cannot read properties of undefined (reading 'enabled')

[Killed] BlockStatement
lib/api/queries.ts:492:59
   const queryClient = useQueryClient();
 
   return useMutation({
-    mutationFn: async (input: Record<string, unknown>) => {
-      const data = await fetchJson<TaskExecutionResponse>(
-        `${API_BASE_URL}/tasks/${name}/execute`,
-        {
-          method: 'POST',
-          body: JSON.stringify({ input }),
-        }
-      );
-      return data;
-    },
+    mutationFn: async (input: Record<string, unknown>) => {},
     onSuccess: () => {
       // Invalidate task execution history to show new execution
killedBy: TanStack Query Hooks useExecuteTask executes task successfully
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
lib/api/queries.ts:495:9
     mutationFn: async (input: Record<string, unknown>) => {
       const data = await fetchJson<TaskExecutionResponse>(
         `${API_BASE_URL}/tasks/${name}/execute`,
-        {
-          method: 'POST',
-          body: JSON.stringify({ input }),
-        }
+        {}
       );
       return data;
killedBy: TanStack Query Hooks useExecuteTask executes task successfully
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
lib/api/queries.ts:497:32
         `${API_BASE_URL}/tasks/${name}/execute`,
         {
           method: 'POST',
-          body: JSON.stringify({ input }),
+          body: JSON.stringify({}),
         }
       );
killedBy: TanStack Query Hooks useExecuteTask handles execution errors
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] BlockStatement
lib/api/queries.ts:502:22
       );
       return data;
     },
-    onSuccess: () => {
-      // Invalidate task execution history to show new execution
-      queryClient.invalidateQueries({
-        queryKey: queryKeys.taskExecutions(name),
-      });
-      // Invalidate task details to update stats
-      queryClient.invalidateQueries({
-        queryKey: queryKeys.taskDetail(name),
-      });
-      // Invalidate tasks list to update overall stats
-      queryClient.invalidateQueries({
-        queryKey: queryKeys.tasks,
-      });
-    },
+    onSuccess: () => {},
   });
 }

[Survived] ObjectLiteral
lib/api/queries.ts:508:37
         queryKey: queryKeys.taskExecutions(name),
       });
       // Invalidate task details to update stats
-      queryClient.invalidateQueries({
-        queryKey: queryKeys.taskDetail(name),
-      });
+      queryClient.invalidateQueries({});
       // Invalidate tasks list to update overall stats
       queryClient.invalidateQueries({
